// Import stylesheets
import './style.css';

const text = `
車キコテホ待事転ニス題康おく身供ハタカ俊日ウアレ九揮ざ化禁たう航熊ぱ格世観る禁構らぴめ目14滑じはも世関へ型時トク好手み海隆侃ッし。農潟で携売ま守長ゆそぞで関楽ネウ骨分イぎいり邦43組ぜ富生エキタ断属ヱニ縮年シセケネ記事ソニコホ載整エ集会目逮陸基ル。5健ミコチ武連京きい証81料で離全ょ体手モス文81再属こお供景ユテタ図服部ニ月共展前つちみ。

数ちろけっ戦37最さしリを考質偽り予権ニレタハ目敬ぐあびみ変船すッいぶ掲法ユセワツ明国かやんが試健ヤレ産果ゅ要広はわ入5侃ろぶ。恵4香ゅしげ省碁ヘメフ給外ぽれざ応台ルシク続声ツユヲ都広しの状保ネ題5習もぶ論呼アムシ女業ホウモ番提経進さ軍祭欲配てぞ。車ス社削アソヘネ身年み点海クナ機治ヘホ児首ヨヒソ司話らがーぜ伝2報似評かのず院俊かにがぽ較話治秘敵フモ喜代たりぽ。

誕しレ付府リ星断ゅ塾信ワヨ島45職イ携足ねスぽ換善あざのげ阜投うて肩四ふおトこ書45認ア店裁モソアレ依擬ヒイツキ礎調画マケヨ区小セヒリ設3苦察乱ばトッ。作はんじ国予ヘ重村ホタメル岳士コノソ悪能禁ぽごイせ宅書ど院務ぱくンき襲訴せ議老わぽちや天写フメ告覧ヒ記毎中羽びゆ年踏ミホヒコ一理ぼ了36店建雪禁かまぞド。

生ヘオニ男広携紀ぐぽね庁得分57土アモ神連こ幾城トフかッ道図ゃは覧石クフ実柴丘甘フみ。調73楽ょぞぜ実能ヤタワメ断旧7融トカナ写員ぴるぽが死側ケマレメ会頭績じ界格ロケ失告めにぞふ阪彩えほた読考はげ枝決せご。六校ヲセハ主最ツヲオ交向ぱる倍気ぼや化近も覧子ヤ著転ろげクけ幾済ぎそち族紙るせ少3変あルや改沢教セ件蛯ラロ記死るぼフび得本ヌセネシ津10万いみべへ。

試なイくこ土具ナエ情視ヌコヤサ月率べ通携ヒアサ説76投うる規球ル希総25下ぼむ勝師ぶぎごげ年右際まにち懐況贈答じぱイ。健クリキニ緑6配治ツム開画イ経馬ラの太作るじつ人康康売ルんみス報断エ振生んざ座受ちがっう者改ナ勧徳飲星催けすン。時ワヌニス第豊マニレミ論玉理げの引7第ラヤ禁毎企ゆーじせ決廟びへ趣惑ヘ世米ハフロソ幸者ヲナラム遺金1証ソ子山ひらもじ思勢そくゃ理文警れリ政派披む。

皇うせ年味ル録治ホヘリ川国特9役れへろ謝務達さラずて基講由オ名支をさゃへ経注ずル領講豪す当42久セ況再ー備6布益せス。喜が飛策誤東え繰73植モヒス通運リチヲ必転ヲオ久更まてどぼ税惑ドへ旬未ヘ競済ぱ天代ぼべかン見山メム質鳥ラぎとッ。語タ氏岡べざぱあ用選よれずき育続ヌトヲ転板権ヒ笠9核イ道行だを教指ツ碁込び職実焦ょへし言興慈抹やイ。

測ぞ臨能たほべ免支リ康囲ぼうらじ大康り況5応カア五企わごょ関関ミヌ台主クソ提川くたぶ豊途キ日芸めじらお線輔告しスり万止勲悔ろばぼな。安本セタヌ能押活ぶしこ船対まイそ発考そとるゅ家道ラてのぐ唯転メチヌサ動店福ヌナオチ隆7団キニヨモ中力シス円州アタ変民つゅぜい有3理海ヱ付守険ちぎべさ。変け三事人ヘサスマ両外トヤ勝車険ツシア朝銀界ぎべ雇関チヘハ隣14応ぽぶだ際探ろあゅ没答拓れちば。

島ソヒロキ節減レをご入族トヱ運応中キ郎信そゆぐ婚健ゅや気権積ホヨミヱ特正トツヌア冬6議モコス放治ドちへ軍当企ーたえ択意定セカニノ団在ぎ沖目のは。学ユコラ由同線ユレテ久紙ぱれゆ恋30報文をぐぜ都4歩ふま界物ッ伊5者ばつ著人ンラ全軍で苦民げをえ川発養カレホ掲便ヒハカ野犯ンず氏暖ほぼ婦観ごき。

植コワソノ玲郎映ミ真罪むは碁語テモノ後無れえクト機渡ヤノウツ階敗エロケナ究載ぐリ報時オ潟止ド一職スキ多置だやわ。候縄ホヨレノ治強15打支無ヱ合戦ず意旅フヲメイ暮様ヤヱ芸事ずう了局ょ好之れさ山無春ね。他チ咲測ン治平マロセ外5指6的フご表日ドぎ終鍛つふ入機もび図転ゆもか禁子へさて城取購じべに座再フとし省画ユコレト公頼まル林馬ネラ官約傘レん。

周覧ばふ尾女こだぱけ真市れ帯能ユミオ芸材ぜくん産読ゃはぎラ治鹿ヘネ法到ちり感月ホタネワ毎36偽おぐびづ県分け府全ウアリシ予解づえ図再ヒノヱヌ世多ヲウヱチ借量色壁て。亀そー径止子カ体8解任育ま央無ーづひへ正医レぴっ検本加ケ保慮すやッ真出ラ査助クゅ死脱ミユヘ再訃ヤタク高佐御婦項冤冶か。
`;
// Write Javascript code!
const textDiv = document.getElementById('characters');
const appDiv = document.getElementById('app');

for (let i in text) {
  const tEl = document.createElement('div');
  tEl.dataset.offset = i * 200;
  tEl.classList.add('block');
  tEl.innerHTML = text[i];
  textDiv.appendChild(tEl);
}

setInterval(() => {
  const list = document.getElementsByClassName('block');

  let random = Math.round(Math.random() * (list.length + 1));
  const aBlock = list[random];

  random = Math.round(Math.random() * text.length);
  if (aBlock) {
    aBlock.innerHTML = text[random] || random;
  }
}, 1000);
